# Формула вычисления площади квадрата следующая:

# S=a^2

# Входные данные
# На вход программе поступает вещественное число a
# Выходные данные
# Программа выводит площадь квадрата

a = float(input())
print(a**2)
