# Напишите программу, которая принимает на вход два целых числа в отдельных строках и выводит на экран их сумму.

a = int(input())
b = int(input())
print(a+b)