# Длина отрезка
# Напишите программу, которая вычисляет длину отрезка (т.е. расстояние между двумя точками), заданного двумя значениями x1 и x2 (вещественные числа).

x1 = float(input())
x2 = float(input())
length = abs(x1 - x2)
print(length)
