# Программа получает на вход строку, и ваша задача — вывести первый символ данной строки.

string1 = input()
print(string1[0])