# Программа получает на вход строку, и ваша задача — вывести последний символ этой строки.

string1 = input()
print(string1[len(string1) - 1])