# Программа получает на вход строку. Ваша задача — вывести все символы этой строки, которые имеют четные индексы.

string1 = input()
print(string1[::2])