# Программа получает на вход строку. Ваша задача — вывести все символы этой строки, которые имеют нечетные индексы.

string1 = input()
print(string1[1::2])