# Программа получает на вход строку. Ваша задача — развернуть строку и вывести ее на экран.

string1 = input()
print(string1[::-1])