# Программа получает на вход строку.

# Выведите каждый третий символ строки в обратном порядке, начиная с последнего.

string1 = input()
print(string1[-1::-3])