# Наиболее часто используемая операция в программировании это увеличение переменной на единицу. Она используется при организации счетчиков значений. Операцию увеличения на единицу также называют инкремент. Давайте и мы реализуем эту операцию.

# Ваша задача увеличить входящее целое значение на единицу используя присвоение с оператором

# Входные данные
# Целое число

x = int(input())
x += 1
print(x)