# Банк обещает внесенную вами сумму увеличить за год в 1.5 раза. Ваша программа должна посчитать сколько вы получите через год, если внесете x рублей

# Входные данные
# Вещественное число x - количество рублей, которые вносите в банк

x = float(input())
x *= 1.5
print(x)