# Создайте этот прекрасный рисунок

# Старайтесь для переноса строк использовать экранированный символ "\n"

# Sample Input:

# Sample Output:

# /\_/\ 
# >^,^< 
#  / \  
# (|_|)_/

string1 = '/\\_/\\\n>^,^<\n / \\\n(|_|)_/'
print(string1)