# Напишите программу, которая вычисляет среднее арифметическое четырех введенных целых чисел.

a, b, c, d = map(int, input().split())
print((a+b+c+d)/4)