# Напишите программу, которая выводит фразу «Я стану крутым программистом!» 
# три раза на отдельных строках; строки должны быть именно такие, символ в символ!.

# Для удобства советую поместить эту фразу в переменную и затем использовать ее при выводе.

print('Я стану крутым программистом!\n' * 3)