# Напишите программу, которая сначала считывает две фразы по очереди,
# а потом воспроизводит их в той же последовательности, каждую на отдельной строчке.

# Sample Input 1:

# Hello!
# Hi!
# Sample Output 1:

# Hello!
# Hi!

string1 = input()
string2 = input()
print(string1 + '\n' + string2)