# Напишите программу, которая сначала считывает три фразы по очереди,
# а потом воспроизводит их в обратной последовательности, каждую на отдельной строчке.


string1 = input()
string2 = input()
string3 = input()
print(string3 + '\n' + string2 + '\n' + string1)
