# Напишите программу, которая считывает с клавиатуры два слова (или фразы, неважно), 
# после чего вы должны при помощи операции конкатенации сцепить вторую фразу с первой и вывести результат на экран.

# Sample Input:

# Один
# Два
# Sample Output:

# ДваОдин


string1 = input()
string2 = input()
print(string2 + string1)