# Напишите программу, которая считывает с клавиатуры слово (или фразу, неважно), после чего вывести данную строку, увеличенную по длине  в 3 раза.

# Sample Input 1:

# Hello
# Sample Output 1:

# HelloHelloHello

string1 = input()
print(string1 * 3)