# Напишите программу, которая проверяет состоит ли введенная строка целиком из строчных букв

# В качестве ответа необходимо вывести True, если условие выполняется, во всех остальных случаях нужно вывести False

string1 = input()
print(string1.islower())